#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
        // Заполнение шапки
            
        Запрос = Новый Запрос;
        Запрос.Текст =
        	"ВЫБРАТЬ
        	|	РеализацияТоваровУслуг.Договор КАК Договор,
        	|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
        	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
        	|	РеализацияТоваровУслуг.Организация КАК Организация,
        	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
        	|ИЗ
        	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        	|ГДЕ
        	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
        
        Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        	
        	Договор = ВыборкаДетальныеЗаписи.Договор;
        	Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
        	Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
        	Организация = ВыборкаДетальныеЗаписи.Организация;
        	Основание = ВыборкаДетальныеЗаписи.Ссылка;  
        	
        КонецЦикла;
                
        
        Ответственный = Пользователи.ТекущийПользователь();

        // Уберем дубли 
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
        |   СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
        |ИЗ
        |   Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
        |ГДЕ
        |   РеализацияТоваровУслугТовары.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |   РеализацияТоваровУслугТовары.Номенклатура";
        
        Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
            
            НоваяСтрока = Товары.Добавить(); 
            ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи); 
            
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти
