
&НаКлиенте
Процедура РаботаСРеквизитами(Команда)
    РаботаСРеквизитамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаботаСРеквизитамиНаСервере()
    
    РеквизитНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура,"ЕдиницаИзмерения.Наименование");
    РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,"ЕдиницаИзмерения.Наименование,НоменклатурнаяГруппа");  
    
    МассивКонтрагентов = Контрагенты.ВыгрузитьЗначения();
    РеквизитКонтрагентов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивКонтрагентов,"ИНН");
    РеквизитыКонтрагентов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивКонтрагентов,"ИНН,КПП");
    
КонецПроцедуры

&НаСервере
Функция СоздаемСкладНаСервере()

   НовыйСклад = Справочники.Склады.СоздатьЭлемент(); 
   НовыйСклад.Наименование  = СкладНаименование;
   НовыйСклад.Записать(); 
   
   Возврат НовыйСклад.Ссылка;
   
КонецФункции

&НаКлиенте
Процедура СоздаемСклад(Команда)    
    
    СозданыйСклад = СоздаемСкладНаСервере();
    ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(СозданыйСклад);   
    
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентФильтрПриИзменении(Элемент)
    
   ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Заказы,"Контрагент",КонтрагентФильтр,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(КонтрагентФильтр)); 
    
    
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
    
    
   ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Комментарий,ЭтотОбъект,"Комментарий","Введите комментарий");
    
    
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
    
    Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
    
    ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение,Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
    
 //  ИмяРеквизитаЗакрытьФормуБезПодтверждения - Строка - имя реквизита, содержащего в себе признак того, нужно
//                                 выводить предупреждение или нет.
//  ОписаниеОповещенияЗакрыть    - ОписаниеОповещения - содержит имя процедуры, вызываемой при нажатии на кнопку "Да".
//
// Пример:    

  //ТекстПредупреждения = НСтр("ru = 'Закрыть тестовую обработку?'");
  //ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ЗакрытьФормуБезПодтверждения");
   
    
КонецПроцедуры     



&НаКлиенте
  Процедура СохранитьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
     // записываем данные формы.
     // ...
     Модифицированность = Ложь; // не выводить подтверждение о закрытии формы еще раз.
     Закрыть();
  КонецПроцедуры


&НаКлиенте
Процедура РаботаемСоСтроками(Команда)

    ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
    
    ТутТолькоЦифры = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТекстоваяСтрока); 
    ТутГуид = СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ТекстоваяСтрока);
    СтрокаВЧисло = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТекстоваяСтрока); 
    
    СообщениеПользователю = СтрШаблон(" %4 : Это Цифры %1 Это гуид %2 Это число %3",ТутТолькоЦифры,ТутГуид,СтрокаВЧисло,ТекущийПользователь);
    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);  
      
КонецПроцедуры


&НаКлиенте
Процедура ВыполнимДлительныйАлгоритм(Команда) 
    
    ДлительнаяОперация =     ВыполнимДлительныйАлгоритмНаСервере(); 
    
 
    
    ПараметрыОжидания =  ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
    ПараметрыОжидания.Интервал = 1;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОповещениеОПрогрессеВыполнения",ЭтотОбъект);
    ПараметрыОжидания.ОповещениеОПрогрессеВыполнения  = ОповещениеОПрогрессеВыполнения;
    ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
    
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);  
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершении,ПараметрыОжидания);
                //
КонецПроцедуры


&НаСервере
Функция ВыполнимДлительныйАлгоритмНаСервере() 
      ДлительнаяОперация  = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
                "Обработки.РаботаСПрограммнымИнтерфейсом.ВыполнитьДлительныйАлгоритм",КоличествоСекунд); 
      
      Возврат ДлительнаяОперация;
   
КонецФункции   

&НаКлиенте

Процедура ОповещениеОПрогрессеВыполнения(Результат,ДополнительныеПараметры) Экспорт 
    
   Если Результат.Прогресс <> Неопределено Тогда
   
   	   Состояние("Чтото делаеться...",Результат.Прогресс.Процент,Результат.Прогресс.Текст);
   
   КонецЕсли; 
КонецПроцедуры  



&НаКлиенте

Процедура ОповещениеОЗавершении(Результат,ДополнительныеПараметры) Экспорт 
    
   Если Результат.Статус = "Выполнено" Тогда
   
   	   Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
   
   КонецЕсли; 
КонецПроцедуры    



